In [32]:
import pandas as pd
import numpy as np
import psycopg
from sqlalchemy import create_engine
from e_com_functions import gen_product_id, get_cost_price

In [33]:
df = pd.read_csv('Sample-Superstore.csv', encoding='ISO-8859-1')

In [34]:
df.shape

(9994, 21)

In [35]:
df.columns

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'Country', 'City', 'State',
       'Postal Code', 'Region', 'Product ID', 'Category', 'Sub-Category',
       'Product Name', 'Sales', 'Quantity', 'Discount', 'Profit'],
      dtype='object')

In [36]:
df["Order Date"] = pd.to_datetime(df["Order Date"])
df["Ship Date"] = pd.to_datetime(df["Ship Date"])

In [37]:
df = get_cost_price(df)

In [38]:
df['Category'].unique()

array(['Furniture', 'Office Supplies', 'Technology'], dtype=object)

In [39]:
df['Sub-Category'].unique()

array(['Bookcases', 'Chairs', 'Labels', 'Tables', 'Storage',
       'Furnishings', 'Art', 'Phones', 'Binders', 'Appliances', 'Paper',
       'Accessories', 'Envelopes', 'Fasteners', 'Supplies', 'Machines',
       'Copiers'], dtype=object)

Creating the Products Table

In [40]:
df['Product ID'].nunique()

1862

In [41]:
# Generating new Product ID

df = gen_product_id(df)

In [42]:
product = df[['id', 'Product Name', 'Cost', 'Sell Price', 'Category', 'Sub-Category']].copy()
product.drop_duplicates(subset='id', inplace=True)
product.columns = product.columns.str.lower().str.replace(' ', '_')
product.rename(columns={'product_name': 'name', 'sub-category': 'sub_category'}, inplace=True)
product.reset_index(inplace=True, drop=True)
product

,id,name,cost,sell_price,category,sub_category
0,FUR-BOO-00000011,Bush Somerset Collection Bookcase,110.0232,130.98,Furniture,Bookcases
1,FUR-CHA-00000050,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",170.7860,243.98,Furniture,Chairs
2,OFF-LAB-00000064,Self-Adhesive Address Labels for Typewriters b...,3.8743,7.31,Office Supplies,Labels
3,FUR-TAB-00000018,Bretford CR4500 Series Slim Rectangular Table,268.1217,348.21,Furniture,Tables
4,OFF-STO-00000030,Eldon Fold 'N Roll Cart System,9.9258,13.98,Office Supplies,Storage
...,...,...,...,...,...,...
1886,TEC-PHO-00000149,RCA ViSYS 25425RE1 Corded phone,95.8429,134.99,Technology,Phones
1887,TEC-MAC-00000009,Cisco 8961 IP Phone Charcoal,129.9636,249.93,Technology,Machines
1888,OFF-APP-00000039,"Eureka Hand Vacuum, Bagless",35.5896,49.43,Office Supplies,Appliances
1889,TEC-PHO-00000085,LG G2,374.9925,499.99,Technology,Phones
1890,OFF-STO-00000032,Eldon Jumbo ProFile Portable File Boxes Graphi...,11.0232,15.31,Office Supplies,Storage

Creating the Customers Table

In [43]:
# Deleteting '-' from customer names

df['Customer Name'] = df['Customer Name'].str.rstrip('-')
df['Customer Name'] = df['Customer Name'].str.replace('-', ' ')

In [44]:
df[df['Customer Name'].str.endswith('-')]['Customer Name']

Series([], Name: Customer Name, dtype: object)

In [45]:
df[df['Customer Name'].str.contains(r'-')]['Customer Name']

Series([], Name: Customer Name, dtype: object)

In [46]:
customer = df[['Customer ID', 'Customer Name', 'Segment']].copy()
customer.drop_duplicates(subset='Customer ID', inplace=True)
name = customer['Customer Name'].str.split(' ')
customer['first_name'] = name.apply(lambda x: x[0])
customer['last_name'] = name.apply(lambda x: x[1])
customer.drop('Customer Name', axis=1, inplace=True)
customer.rename(columns={'Customer ID': 'id', 'Segment': 'segment'}, inplace=True)
customer.reset_index(inplace=True, drop=True)
customer

           id      segment first_name    last_name
0    CG-12520     Consumer     Claire         Gute
1    DV-13045    Corporate     Darrin          Van
2    SO-20335     Consumer       Sean    O'Donnell
3    BH-11710     Consumer    Brosina      Hoffman
4    AA-10480     Consumer     Andrew        Allen
..        ...          ...        ...          ...
788  CJ-11875    Corporate       Carl      Jackson
789  RS-19870  Home Office        Roy       Skaria
790  SC-20845     Consumer       Sung        Chung
791  RE-19405     Consumer    Ricardo      Emerson
792  SM-20905     Consumer      Susan  MacKendrick

[793 rows x 4 columns]

Creating the Address Table

In [47]:
# Generating unique Address IDs

address_group = df.groupby(['Country', 'Region', 'State', 'City', 'Postal Code'])
for i, (key, item) in enumerate(address_group):
    item['address_id'] = str(i).zfill(8)
    for index, row in item['address_id'].items():
        df.loc[index, 'address_id'] = row

In [48]:
address = df[['address_id', 'Country', 'Region', 'State', 'City', 'Postal Code']].copy()
address.drop_duplicates(subset='address_id', inplace=True)
address.columns = address.columns.str.lower().str.replace(' ', '_')
address.rename(columns={'address_id': 'id'}, inplace=True)
address.reset_index(inplace=True, drop=True)
address

,id,country,region,state,city,postal_code
0,00000384,United States,South,Kentucky,Henderson,42420
1,00000500,United States,West,California,Los Angeles,90036
2,00000340,United States,South,Florida,Fort Lauderdale,33311
3,00000499,United States,West,California,Los Angeles,90032
4,00000403,United States,South,North Carolina,Concord,28027
...,...,...,...,...,...,...
627,00000330,United States,South,Arkansas,Springdale,72762
628,00000495,United States,West,California,Lodi,95240
629,00000159,United States,Central,Texas,La Porte,77571
630,00000290,United States,East,Ohio,Mason,45040
631,00000380,United States,South,Georgia,Woodstock,30188

Preparing the Resident Table

In [49]:
resident = df[['address_id', 'Customer ID']].copy()
resident.drop_duplicates(subset=['address_id', 'Customer ID'], inplace=True)
resident.rename(columns={'Customer ID': 'customer_id'}, inplace=True)
resident.reset_index(inplace=True, drop=True)
resident

     address_id customer_id
0      00000384    CG-12520
1      00000500    DV-13045
2      00000340    SO-20335
3      00000499    BH-11710
4      00000403    AA-10480
...         ...         ...
4905   00000498    ML-17410
4906   00000370    RA-19885
4907   00000352    TB-21400
4908   00000476    DB-13060
4909   00000550    CC-12220

[4910 rows x 2 columns]

Creating the Shipment Table

In [50]:
# Generating unique Shipment IDs

ship_group = df.groupby(['Order ID'])
for i, (key, item) in enumerate(ship_group):
    group = ship_group.get_group(key[0])
    country_char = group['Country'].unique()[0][:2].upper()
    state_char = group['State'].unique()[0][:2].upper()
    item['shipment_id'] = country_char + state_char + str(i).zfill(8)
    for index, row in item['shipment_id'].items():
        df.loc[index, 'shipment_id'] = row

In [51]:
shipment = df[['shipment_id', 'Ship Mode', 'address_id', 'Ship Date']].copy()
shipment.drop_duplicates(subset='shipment_id', inplace=True)
shipment.columns = shipment.columns.str.lower().str.replace(' ', '_')
shipment.rename(columns={'shipment_id': 'id'}, inplace=True)
shipment

                id       ship_mode address_id  ship_date
0     UNKE00002500    Second Class   00000384 2016-11-11
2     UNCA00002296    Second Class   00000500 2016-06-16
3     UNFL00004372  Standard Class   00000340 2015-10-18
5     UNCA00000201  Standard Class   00000499 2014-06-14
12    UNNO00003084  Standard Class   00000403 2017-04-20
...            ...             ...        ...        ...
9986  UNCA00002098  Standard Class   00000498 2016-10-03
9987  UNGE00004076  Standard Class   00000370 2017-11-21
9989  UNFL00000138    Second Class   00000352 2014-01-23
9990  UNCA00003216  Standard Class   00000476 2017-03-03
9993  UNCA00003194    Second Class   00000550 2017-05-09

[5009 rows x 4 columns]

Preparing Order Table

In [52]:
order = df[['Order ID', 'Order Date', 'Customer ID']].copy()
order.drop_duplicates(subset='Order ID', inplace=True)
order.columns = order.columns.str.lower().str.replace(' ', '_')
order.rename(columns={'order_id': 'id'}, inplace=True)
order.reset_index(inplace=True, drop=True)
order

                  id order_date customer_id
0     CA-2016-152156 2016-11-08    CG-12520
1     CA-2016-138688 2016-06-12    DV-13045
2     US-2015-108966 2015-10-11    SO-20335
3     CA-2014-115812 2014-06-09    BH-11710
4     CA-2017-114412 2017-04-15    AA-10480
...              ...        ...         ...
5004  CA-2016-125794 2016-09-29    ML-17410
5005  CA-2017-163629 2017-11-17    RA-19885
5006  CA-2014-110422 2014-01-21    TB-21400
5007  CA-2017-121258 2017-02-26    DB-13060
5008  CA-2017-119914 2017-05-04    CC-12220

[5009 rows x 3 columns]

Preparing Order Items Table

In [53]:
orderitems = df.groupby(['id', 'Order ID', 'Discount', 'shipment_id'])['Quantity'].sum().reset_index()
orderitems.columns = orderitems.columns.str.lower()
orderitems.rename(columns={'id': 'product_id', 'order id': 'order_id'}, inplace=True)
orderitems

            product_id        order_id  discount   shipment_id  quantity
0     FUR-BOO-00000000  CA-2016-106383      0.70  UNCO00001795         1
1     FUR-BOO-00000000  CA-2017-124674      0.32  UNTE00003300         2
2     FUR-BOO-00000001  CA-2014-155796      0.50  UNPE00000654         4
3     FUR-BOO-00000001  CA-2015-102281      0.20  UNNE00000831         3
4     FUR-BOO-00000001  CA-2015-111514      0.15  UNCA00000956         7
...                ...             ...       ...           ...       ...
9981  TEC-PHO-00000188  CA-2015-140144      0.20  UNCA00001330         3
9982  TEC-PHO-00000188  CA-2015-156335      0.00  UNNE00001546         2
9983  TEC-PHO-00000188  CA-2016-108882      0.20  UNCA00001830         9
9984  TEC-PHO-00000188  CA-2017-111647      0.20  UNTE00003038         4
9985  TEC-PHO-00000188  US-2014-134733      0.20  UNCA00004273         2

[9986 rows x 5 columns]

In [54]:
with psycopg.connect('dbname=store user=postgres password=postgresql') as conn:

    with conn.cursor() as cur:

        cur.execute("""
            CREATE TABLE IF NOT EXISTS customer (
            "id" varchar PRIMARY KEY,
            "first_name" varchar(128),
            "last_name" varchar(128),
            "segment" varchar(128)
            );

            CREATE TABLE IF NOT EXISTS address (
            "id" integer PRIMARY KEY,
            "country" varchar(128),
            "region" varchar(128),
            "state" varchar(128),
            "city" varchar(128),
            "postal_code" integer
            );

            CREATE TABLE IF NOT EXISTS resident (
            "customer_id" varchar(16),
            "address_id" integer,
            PRIMARY KEY ("customer_id", "address_id"),
            FOREIGN KEY ("customer_id") REFERENCES "customer" ("id"),
            FOREIGN KEY ("address_id") REFERENCES "address" ("id")
            );

            CREATE TABLE IF NOT EXISTS product (
            "id" varchar(16) PRIMARY KEY,
            "name" text,
            "cost" float,
            "sell_price" float,
            "category" varchar(128),
            "sub_category" varchar(128)
            );

            CREATE TABLE  IF NOT EXISTS orders (
            "id" varchar(32) PRIMARY KEY,
            "order_date" date,
            "customer_id" varchar(16),
            FOREIGN KEY ("customer_id") REFERENCES "customer" ("id")
            );

            CREATE TABLE IF NOT EXISTS shipment (
            "id" varchar(64) PRIMARY KEY,
            "ship_mode" varchar(64),
            "address_id" integer,
            "ship_date" date,
            FOREIGN KEY ("address_id") REFERENCES "address" ("id")
            );

            CREATE TABLE IF NOT EXISTS orderitems (
            "product_id" varchar(16),
            "order_id" varchar(32),
            "discount" float,
            "quantity" integer,
            "shipment_id" varchar(64),
            PRIMARY KEY ("product_id", "order_id"),
            FOREIGN KEY ("product_id") REFERENCES "product" ("id"),
            FOREIGN KEY ("order_id") REFERENCES "orders" ("id"),
            FOREIGN KEY ("shipment_id") REFERENCES "shipment" ("id")
            );
        """)

In [55]:
tables = {
    'customer': customer,
    'product': product,
    'address': address,
    'resident': resident,
    'orders': order,
    'shipment': shipment,
    'orderitems': orderitems
    }

In [56]:

engine = create_engine('postgresql+psycopg://postgres:postgresql@localhost:5432/store')

for name, table in tables.items():
    table.to_sql(name, engine, if_exists='append', index=False)